# 再起動が入るsetup.shを先に実行しておく
# apt-get install でエラーが出たら、/usr/bin/pythonのリンクを2.7にしてapt-get removeする
# ModuleNotFoundError: No module named 'ConfigParser'
# sudo rm /usr/bin/python
# sudo ln -s /usr/bin/python2.7 /usr/bin/python

#real	84m26.179s
#user	77m29.928s
#sys	3m4.020s


########################################
# Ubuntu 16.04 パッケージ更新
########################################
apt-get update
apt-get install -y htop locate


########################################
# Python3.6 インストール
########################################
./install_python3.6.sh


########################################
# pip3 install
########################################
./install_pip3.sh


########################################
# Jupyter インストール
########################################
./install_jupyter.sh
# パスワード：mypassword


########################################
# Java8 インストール
########################################
./install_java8.sh


########################################
# Build Tools インストール
########################################
./install_build_tools.sh


########################################
# CUDA deviceQueryビルド
########################################
./install_cuda_deviceQuery.sh


########################################
# OpenCV用にCUDAヘッダーパッチ適用
########################################
# OpenCV make中にエラーが発生するため、cudaヘッダを書き換えるパッチを当てる
./install_cv_patch.sh


########################################
# OpenCV 3.4.1 パッケージ作成/インストール
########################################
#./build_opencv-3.4.1.sh
./install_opencv-3.4.1.sh


########################################
# bazel-0.12.0
########################################
#./build_bazel-0.12.0.sh


########################################
# TensorFlow r1.6.1
########################################
#./build_tensorflow-r1.6.1.sh
./install_tensorflow.sh 1.6.1


########################################
# TensorFlow c++ r1.4.1
########################################
#./build_tensorflow-cpp-r1.4.1.sh
#./install_tensorflow-cpp-r1.4.1.sh

