#!/bin/bash

########################################
# CPUファン自動起動
########################################
./setup_cpufun.sh


########################################
# CPUファンを有効にする
########################################
# ref: http://elinux.org/Jetson/TX1_Controlling_Performance
sh -c 'echo 255 > /sys/kernel/debug/tegra_fan/target_pwm'


########################################
# Ubuntu 16.04 パッケージ更新
########################################
./setup_update.sh


########################################
# .bashrc (ubuntu/root両方)
########################################
./setup_bash.sh


########################################
# dircolors
########################################
./setup_dircolors.sh


########################################
# SPIDev有効化
########################################
# ソースコードのファイル名、展開後のディレクトリ名は毎回変わっているので確認すること
#./setup_spi.sh


########################################
# reboot
########################################
reboot


########################################
# SPI確認
########################################
lsmod
#Module                  Size  Used by
#fuse                   82192  2
#bcmdhd               7441995  0
#spidev                  9920  0
#pci_tegra              61290  0
#bluedroid_pm           11195  0

ls /dev/spidev3.*
#24665 0 /dev/spidev3.0  24666 0 /dev/spidev3.1
